Parts were not created because fabrication configuration is not available.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CreatePartsWithoutDabasebase { get; }
  Visual Basic
Public Shared ReadOnly Property CreatePartsWithoutDabasebase As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CreatePartsWithoutDabasebase {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SystemsFailures Class
  Autodesk.Revit.DB Namespace